{
  "start": [
    {
      "id": "1",
      "desc": "Te encuentras a las puertas de un antiguo templo perdido. Tu objetivo es encontrar el tesoro escondido dentro del templo resolviendo pruebas. Debes utilizar métodos  GET, POST, PUT y DELETE para avanzar. ¡Buena suerte!",
      "desc2": "Ves a http://localhost:3000/pistas/1 para ver la primera pista."
    }
  ],
  "pistas": [
    {
      "id": "1",
      "desc": "Encuentra la primera pista en la entrada del templo. Responde en el endpoint respostas añadiendo 'entrada' para continuar."
    },
    {
      "id": "2",
      "desc": "La primera pista te lleva a una estatua antigua. Responde con 'estatua'."
    }
  ],
  "respuestas": [
    {
      "id": "entrada",
      "desc": "Encontraste la primera pista. En la entrada del templo, encuentras un mapa deteriorado y una parte del código para abrir la puerta principal. VES A LA PREGUNTA 2",
      "siguiente_paso": "Realiza un PUT a /acciones/reparar_mapa para reparar el mapa.CAMBIA EL VALOR A TRUE"
    },
    {
      "id": "estatua",
      "desc": "Encontraste la segunda pista. En la base de la estatua, encuentras una llave y otra parte del código. EN ESTE ENDPOINT DIIGETE A codigo_correcto",
      "siguiente_paso": "Realiza un DELETE a /acciones/borrar_hierbas para descubrir la entrada secreta."
    },
    {
      "id": "codigo_correcto",
      "desc": "Código correcto. La entrada secreta está desbloqueada. Ahora necesitas registrar el cofre encontrado para completar el juego. PARA ACABAR DIRIGETE A registro",
      "siguiente_paso": "Haz un POST a /acciones/registrar_cofre para registrar el cofre."
    },
    {
      "id": "registro",
      "desc": "Cofre registrado correctamente. Has completado el juego y encontrado el tesoro del templo perdido.",
      "siguiente_paso": "Registra tu nombre en el endpoint 'ganador' para completar el desafío. UTILIZANDO EL PUT"
    }
  ],
  "acciones": [
    {
      "id": "reparar_mapa",
      "desc": "Reparar el mapa deteriorado.",
      "completed": false
    },
    {
      "id": "borrar_hierbas",
      "desc": "Borrar las hierbas que cubren la entrada secreta.",
      "completed": false
    }
  ],
  "ganador": [
    {
      "id": "1",
      "nombre": "ANDREA_NICO_ADRI 1"
    }
  ]
}
